"use strict";

import React from 'react';
import ReactDOM from 'react-dom';

//import VotesBlock from './components/GoodList';
import GoodList from './components/GoodList';

var goods=[ 
  {id: '1282235', name: 'Гироскутер 350W, 36V 4.4A, колеса 6.5", 10 км/ч, Bluetooth, подсветка, с ручкой',	count: 1,	price: 8450}, 
  {id: '1282236', name: 'Гироскутер 350W, 36V 4.4A, колеса 6.5", 10 км/ч, Bluetooth, подсветка, с ручкой',	count: 1, price: 7500}, 
  {id: '1282237', name: 'Гироскутер 350W, 36V 4.4A, колеса 6.5", 10 км/ч, Bluetooth, подсветка, до 80 кг',	count: 1,	price: 7500}, 
  {id: '1282238', name: 'Гироскутер 350W, 36V 4.4A, колеса 6.5", 10 км/ч, Bluetooth, подсветка, до 80 кг',	count: 1,	price: 7500}, 
  {id: '1383314', name: 'Гироскутер 350W, 36V 4.4A, колеса 6.5", 10 км/ч, Bluetooth, подсветка, до 80 кг',	count: 1,	price: 7500}, 
  {id: '1383317', name: 'Гироскутер 350W, 36V 4.4A, Bluetooth,подсв,кол 6.5 дюйм,10 км/ч, вес пол.до120 кг,цв.белый',	count: 8, price: 8500}, 
  {id: '2858009', name: 'Гироскутер 350W, 36V 4.4А, 6,5", Самобаланс,Тао-Тао,Bluetooth,подсветка, с ручкой',	count: 1,	price: 7999}, 
  {id: '2858010', name: 'Гироскутер 350W, 36V 4.4А, 6,5", Самобаланс,Тао-Тао,Bluetooth,подсветка, с ручкой',	count: 5,	price: 7999}, 
  {id: '2858011', name: 'Гироскутер 350W, 36V 4.4А, 6,5", Самобаланс,Тао-Тао,Bluetooth,подсветка, с ручкой',	count: 1,	price: 7999}, 
  {id: '2858013', name: 'Гироскутер 350W, 36V 4.4А, 6,5"+ Самобаланс+Тао-Тао+Bluetooth+свет, цвет абстракция',	count: 9, price: 9999}, 
  {id: '2858014', name: 'Гироскутер 350W, 36V 4.4А, 6,5"+ Самобаланс+Тао-Тао+Bluetooth+свет, цвет космос',	count: 4,		price: 9999}, 
  {id: '2858015', name: 'Гироскутер 350W, 36V 4.4А, 8,5", Самобаланс,Тао-Тао,Bluetooth,подсв, с ручкой, чехол',	count: 5,	price: 9999}, 
  {id: '2858016', name: 'Гироскутер 350W, 36V 4.4А, 8,5", Самобаланс,Тао-Тао,Bluetooth,подсв, с ручкой, чехол',	count: 1,	price: 9999}, 
  {id: '2858017', name: 'Гироскутер 350W, 36V 4.4А, 8,5", Самобаланс,Тао-Тао,Bluetooth,подсв, с ручкой, чехол',	count: 1,	price: 9999}, 
  {id: '2858019', name: 'Гироскутер 350W, 36V 4.4А, 10,5", Самобаланс,Тао-Тао,Bluetooth,подсветка',	count: 9,	price: 10800}, 
  {id: '2858020', name: 'Гироскутер 350W, 36V 4.4А, 10", Самобаланс,Тао-Тао,Bluetooth,подсветка',	count: 2,	price: 10999}, 
  {id: '2858021', name: 'Гироскутер 350W, 36V 4.4А, 10,5", Самобаланс,Тао-Тао,Bluetooth,подсветка',	count: 1,	price: 12200}, 
  {id: '2858022', name: 'Гироскутер 350W, 36V 4.4А, 10,5", Самобаланс,Тао-Тао,Bluetooth,подсветка',	count: 1,	price: 12200}, 
  {id: '2858023', name: 'Гироскутер 350W, 36V 4.4А, 10,5", Самобаланс,Тао-Тао,Bluetooth,подсветка',	count: 1,	price: 12200}, 
  {id: '2858024', name: 'Гироскутер 350W, 36V 4.4А, 10,5", Самобаланс,Тао-Тао,Bluetooth,подсветка',	count: 1,	price: 11999}, 
  {id: '2858025', name: 'Гироскутер 350W, 36V 4.4А, 10,5", Самобаланс,Тао-Тао,Bluetooth,подсветка',	count: 1,	price: 12200}, 
  {id: '2858026', name: 'Гироскутер 350W, 36V 4.4А, 10,5", Самобаланс,Тао-Тао,Bluetooth,подсветка',	count: 1,	price: 12200}, 
  {id: '2858028', name: 'Гироскутер 350W, 36V 4.4А, 10,5", Самобаланс,Тао-Тао,Bluetooth,подсветка',	count: 1,	price: 12500}, 
  {id: '2858029', name: 'Гироскутер 350W, 36V 4.4А, 8,5", Самобаланс,Тао-Тао,Bluetooth,подсветка',	count: 1,	price: 13999}, 
];

ReactDOM.render(
  <GoodList
  goods = {goods}
  />
  , document.getElementById('container') 
);

